#include "core.h"
#include "myclass.h"
#include "mytree.h"

using namespace std;

// 先遍历元素
class Solution
{
public:
    int change(int amount, vector<int> &coins)
    {
        // 可以看成重量和价值等值的完全背包问题
        // dp[i]：表示放满背包容量为i的时候有多少方案
        // dp[i]初始化：全是0，因为不知道有多少中，在后续遍历的时候，从低位逐渐向高位填充dp的值
        // 这里dp[0]必须初始化为0，不然无法从低位向高位填充dP
        // 递推顺序：顺序遍历
        // 递推公式：当前重量为w，则dp[i]=dp[i-w]+dp[i];
        vector<unsigned long long> dp(amount + 1, 0);
        dp[0] = 1;
        for (auto w : coins)
        {
            for (int bagsize = w; bagsize <= amount; ++bagsize)
            {
                dp[bagsize] += dp[bagsize - w];
            }
        }
        return dp[amount];
    }
};

// 先遍历背包
class Solution
{
public:
    int change(int amount, vector<int> &coins)
    {
        // 这个是一个错误演示
        // 之前正确的是先遍历元素，再遍历背包，这个思路简单易懂
        // 下面的代码是，先遍历背包，再遍历元素，这两种思路有什么区别？为什么下面的是错误的。
        // 先遍历元素的方法称为做法1，先遍历背包的方法称为做法2
        // 做法1在coins为{1,2,5}amount为3的时候，输出为{1,1,1}和{1，2}
        // 做法2的输出是{1，1，1} {1，2} {2，1}
        // 因为做法1的顺序已经是固定了的，不可能先去遍历2再去遍历1，所以做法1可以近似看成是一个组合问题
        // 但是做法2，在遍历背包容量的过程中，会一次一次地循环遍历coins整个集合，因此先遍历1之后遍历2，
        // 以及先遍历2然后再遍历1都是可能的，所以做法2可以近似看成是一个排列问题。
        // 而这两种遍历方式被当成是答案的两种做法，实际上这个是一种做法
        // 因此做法2的思路虽然和做法1差不多，但实际上是错误的
        vector<unsigned long long> dp(amount + 1, 0);
        dp[0] = 1;
        for (int bagsize = 0; bagsize <= amount; ++bagsize)
        {
            for (int i = 0; i < coins.size(); ++i)
            {
                int w = coins[i];
                int v = w;
                if (w <= bagsize)
                {
                    dp[bagsize] += dp[bagsize - w];
                }
            }
        }
        return dp[amount];
    }
};

int main()
{
    Solution so;
    vector<int> obj_weights{2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 126, 128, 130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178, 180, 182, 184, 186, 188, 190, 192, 194, 196, 198, 200, 202, 204, 206, 208, 210, 212, 214, 216, 218, 220, 222, 224, 226, 228, 230, 232, 234, 236, 238, 240, 242, 244, 246, 248, 250, 252, 254, 256, 258, 260, 262, 264, 266, 268, 270, 272, 274, 276, 278, 280, 282, 284, 286, 288, 290, 292, 294, 296, 298, 300, 302, 304, 306, 308, 310, 312, 314, 316, 318, 320, 322, 324, 326, 328, 330, 332, 334, 336, 338, 340, 342, 344, 346, 348, 350, 352, 354, 356, 358, 360, 362, 364, 366, 368, 370, 372, 374, 376, 378, 380, 382, 384, 386, 388, 390, 392, 394, 396, 398, 400, 402, 404, 406, 408, 410, 412, 414, 416, 418, 420, 422, 424, 426, 428, 430, 432, 434, 436, 438, 440, 442, 444, 446, 448, 450, 452, 454, 456, 458, 460, 462, 464, 466, 468, 470, 472, 474, 476, 478, 480, 482, 484, 486, 488, 490, 492, 494, 496, 498, 500, 502, 504, 506, 508, 510, 512, 514, 516, 518, 520, 522, 524, 526, 528, 530, 532, 534, 536, 538, 540, 542, 544, 546, 548, 550, 552, 554, 556, 558, 560, 562, 564, 566, 568, 570, 572, 574, 576, 578, 580, 582, 584, 586, 588, 780, 936, 1170, 1560, 2340, 4680};
    vector<int> obj_weights2{1, 2, 5};

    cout << so.change(4681, obj_weights) << endl;
}